/* 
  Localizable.strings
  FCC

  Copyright (c) 2011-2014 SamKnows Limited. All rights reserved.
*/


/* General Strings */

"Done"              = "Done";
"Offline_message"   = "The internet connection appears to be offline. Please connect and try again";
"Data_Might_Be_Exceeded"     = "Data Cap Might Be Exceeded";
"Data_Exceeded"     = "Data Cap Exceeded";
"Data_Exceed_Msg"   = "Do you wish to continue anyway?";

"Phone"             = "Phone";
"OS"                = "Operating System";
"Carrier_Name"      = "Carrier name";
"Carrier_Country"   = "Carrier country code";
"Carrier_Network"   = "Carrier network code";
"Carrier_ISO"       = "Carrier ISO country code";
"Network_Type"      = "Network Type";
"Radio_Technology"  = "Radio Technology";

"Label_Active"          = "Active metrics";
"Label_Passive"         = "Passive metrics";
"Test_Run_Download"     = "Download";
"Test_Run_Upload"       = "Upload";
"Test_Run_LatencyLoss"  = "Latency / Loss";
"Test_Run_Jitter"       = "Jitter";
"Test_Run_All"          = "All";
"Tests_Running_Title"   = "Tests Running";
"Tests_Running_Message" = "You are recommended to wait until the tests complete. Do you really want to stop the tests?";

// Social Media posting
"Dismiss"            = "Dismiss";
"Post successful"    = "Post successful";
"Posted"             = "Posted";

// Social Media string text
"SocialMedia_Header_Twitter_Carrier"     = "Testing #mobilebroadband speed on @";
"SocialMedia_Header_Twitter_NoCarrier"   = "Testing #mobilebroadband speed";
"SocialMedia_Header_SinaWeibo_Carrier"   = "Testing #mobilebroadband# speed on @";
"SocialMedia_Header_SinaWeibo_NoCarrier" = "Testing #mobilebroadband# speed";
"SocialMedia_Header_Facebook_Carrier"    = "Now testing my actual #mobilebroadband speed on ";
"SocialMedia_Header_Facebook_NoCarrier"  = "Now testing my actual #mobilebroadband speed";

"SocialMedia_Header_Twitter_Carrier_Average"     = "Testing average #mobilebroadband speed on @";
"SocialMedia_Header_Twitter_NoCarrier_Average"   = "Testing average #mobilebroadband speed";
"SocialMedia_Header_SinaWeibo_Carrier_Average"   = "Testing average #mobilebroadband# speed on @";
"SocialMedia_Header_SinaWeibo_NoCarrier_Average" = "Testing average #mobilebroadband# speed";
"SocialMedia_Header_Facebook_Carrier_Average"    = "Now testing my average #mobilebroadband speed with ";
"SocialMedia_Header_Facebook_NoCarrier_Average"  = "Now testing my average #mobilebroadband speed";

"SocialMedia_Footer_Short"               = "with FCC Speed Test by @SamKnows http://bit.ly/1lzG5V6";
"SocialMedia_Footer_Long"                = "using FCC Speed Test, by SamKnows. Get the app yourself here http://bit.ly/1lzG5V6";
"SocialMedia_TwitterIfUsingImage_ChangeFromThis1" = "Testing average";
"SocialMedia_TwitterIfUsingImage_ChangeToThis1" = "Testing";
"SocialMedia_TwitterIfUsingImage_ChangeFromThis2" = "Testing actual";
"SocialMedia_TwitterIfUsingImage_ChangeToThis2" = "Testing";
"SocialMedia_TwitterIfUsingImage_ChangeRegex4From" = ", Up:.* with";
"SocialMedia_TwitterIfUsingImage_ChangeRegex4To" = " with";

"SocialMedia_Download_Short" = "Down";
"SocialMedia_Upload_Short"   = "Up";

"Test_Download"         = "Download";
"Test_Upload"           = "Upload";
"Test_Latency"          = "Latency";
"Test_Packetloss"       = "Packet loss";
"Test_Jitter"           = "Jitter";
"Test_Loss"             = "Loss";

"TC_Title"              = "Terms";
"TC_Label"              = "Privacy & Terms of Use";
"TC_Label_Data"         = "Data Consumption";
"TC_App_Activated"      = "The application has now been activated";

"ACTV_Title"            = "Activation";
"ACTV_Label"            = "Activation";
"ACTV_Running"          = "Please wait for the setup process to complete";
"ACTV_Label_Activating" = "Activate";
"ACTV_Label_Downloading"= "Download configuration";
"ACTV_Label_Completed"  = "Find Best Target";
"ACTV_Label_Server"     = "Server";
"ACTV_Label_Time"       = "Time";

"RESULTS_Title"         = "FCC Speed Test";
"RESULTS_Label"         = "Average Results";
"RESULTS_Label_Run"     = "Run now";
"RESULTS_Label_Date_Last_Run"    = "Test last run : ";
"RESULTS_Label_Data"    = "There is no data. Run a test to gather data.";

"RESULTS_Label_Date_1_Week"  = "Results for 1 week";
"RESULTS_Label_Date_1_Month"  = "Results for 1 month";
"RESULTS_Label_Date_3_Months"  = "Results for 3 months";
"RESULTS_Label_Date_6_Months"  = "Results for 6 months";
"RESULTS_Label_Date_1_Year"  = "Results for 1 year";
"RESULTS_Label_Date_1_Day"  = "Results for 1 day";

"time_period_1month" = "1 Month";
"time_period_1week" = "1 Week";
"time_period_1year" = "1 Year";
"time_period_2week" = "2 Weeks";
"time_period_3months" = "3 Months";
"time_period_1day" = "1 Day";

"TEST_Title"                = "FCC Speed Test";
"TEST_Label_Single"         = "Running Test";
"TEST_Label_Multiple"       = "Running Tests";
"TEST_Label_Finding_Best_Target"        = "Finding Best Target...";
"TEST_Label_Closest_Target" = "Best target: ";
"TEST_Label_Closest_Failed" = "Best target test failed";

"RESULT_Title"         = "Archived Results";
"RESULT_Label"         = "Archived Result";

/* Terms & Conditions Screen 1 */


"Msg_0_0" = "We do not label the data we collect from you with anything that would directly identify your handset.  Because your data is part of an anonymous pool that includes information collected from all participants, the risk of someone being able to successfully identify an individual from the data is minimal.";

"Msg_0_1" = "When we measure your mobile broadband performance, we identify the location and unique ID of the cell tower that is providing that service, and the GPS location of your device when the measurements were made.";

"Msg_0_2" = "We record the times when we perform measurements of your mobile broadband performance.  Some measurements function by recording a start and end time.";

"Msg_0_3" = "When the measurement Application starts, we record the manufacturer and model of phone you are using, and the version of the operating system installed on your phone.";

"Msg_0_4" = "We collect information about your cellular phone performance, such as your service provider, the strength of the radio signal, and what type of connection (3G or 4G) service you have.";

"Msg_0_5" = "The Application tests your mobile broadband upload and download rate, round trip latency, and packet loss measured between your handset and our servers managed by the FCC, the FCC contractor, and other project partners.";


/* Terms & Conditions Screen 2 */


"Msg_1_0" = "The FCC has contracted with a broadband measurement company, SamKnows (URL www.samknows.com/privacy), to help manage the program and conduct its technical functions. SamKnows performs functions such as writing and maintaining the software that performs the test measurements, responding to customer service requests, managing the application and the execution of tests, collecting and protecting data gathered in the trial, and providing analysis and support for the preparation of FCC reports. The terms of our contract with SamKnows include obligations to protect the data and your privacy and can be found at (URL for contract).";

"Msg_1_1" = "Research platforms and your carrier may support various aspects of the testing and architecture for the program.  Information we collect may be shared with these parties for the purpose of conducting the trial, and will be protected by non-disclosure agreements that include strict requirements for safeguarding the collected data.";

"Msg_1_2" = "The FCC directs researchers, its contractor, and your carrier working under non-disclosure agreements (NDA) to analyze the collected data for privacy risks or concerns and to plan for future measurement efforts.  We may share your detailed mobile performance data with these partners supporting our data processing and analysis for the specific purpose of identifying patterns in the data and recommending ways of addressing any concerns for your privacy and anonymity.  Researchers and other partners supporting this analysis are skilled in the field of statistics and computer science to identify patterns that a third party might exploit in ways to compromise your privacy, for example by comparing the location information with other sources of information.  If we find concerns, we will take steps to address the risks by making the time, location or other information less specific, limiting the combinations of information we release, or deleting information.  These partners are required to sign an NDA and must agree to data handling practices that safeguard the data.  The NDA prohibits any public disclosure of the data except in the form of a report to the FCC, limits both the access duration and specific research purposes of data, and requires disclosures if the data is ever compromised in any way.  (URI in sentence: <link to NDA>)";

"Msg_1_3" = "For example, the analysis we perform would identify and address risks from a third party combining the location information in the data we collect with other sources of information to try to identify your handset in our database.  We will publicly release the results of this analysis to ensure the quality of our review, and will also describe the measures we took to protect your anonymity.  We will not release individual volunteers' time and location information publicly.";


/* Terms & Conditions Screen 3 */

"Msg_2_0" = "About the FCC and Paperwork Reduction Act of 1995 Notice The Federal Communications Commission (FCC) is an independent United States Government agency. The FCC was established by the Communications Act of 1934 and is charged with regulating interstate and international communications by radio, television, wire satellite and cable. We have estimated that each volunteer participating in this study will assume a one hour time burden over the course of the study. Our estimate includes the time to install software on your device, and periodic validation of data and the application.  If you have any comments on this estimate, or on how we can improve the collection and reduce the burden it causes you, please write the Federal Communications Commission, Office of Managing Director, AMDPERM, Washington, DC 20554, Paperwork Reduction Act Project (30601139).  We will also accept your comments via the Internet if you send an e-mail to PRA@fcc.gov. Please DO NOT SEND COMPLETED APPLICATION FORMS TO THIS ADDRESS.   You are not required to respond to a collection of information sponsored by the Federal government, and the government may not conduct or sponsor this collection, unless it displays a currently valid OMB control number and provides you with this notice.This collection has been assigned an OMB control number of 30601139. THIS NOTICE IS REQUIRED BY THE PAPERWORK REDUCTION ACT OF 1995, PUBLIC LAW 104-13, OCTOBER 1, 1995, 44 U.S.C. SECTION 3507.";

//
// Strings required by SKTransferOperation.m ...
//
"to_UpStream" = "upstream";
"to_DownStream" = "downstream";
"to_StatusInitializing" = "Initializing";
"to_StatusWarming" = "Warming";
"to_StatusTransferring" = "Transferring";
"to_StatusComplete" = "Complete";
"to_StatusCancelled" = "Cancelled";
"to_StatusFailed" = "Failed";
"to_StatusFinished" = "Finished";
"to_StatusIdle" = "Idle";

//
// Strings required by LatencyOperation.m ...
//
"lo_Idle" = "Idle";
"lo_Initializing" = "Initializing";
"lo_Running" = "Running";
"lo_Complete" = "Complete";
"lo_Finished" = "Finished";
"lo_Cancelled" = "Cancelled";
"lo_Timeout" = "Timeout";
"lo_Searching" = "Searching...";
"lo_Failed" = "Failed";

//
// Strings required by SKHttpTest.m ...
//
"ht_Failed_Download" = "Download speed test was not successful.";
"ht_Failed_Upload"   = "Upload speed test was not successful.";
"ht_Speed_Download" = "The test download speed reached %.4f Mbps.";
"ht_Speed_Upload" = "The test upload speed reached %.4f Mbps.";

//
// Strings required by Latency.m...
//
"lt_Latency_Results" = "The latency is %d ms. Packet loss is %d %%. The jitter is %d ms.";
"lt_Latency_Failed" = "The latency test failed.";

// Network type dialog
"NetworkTypeMenu_Mobile" = "Mobile";
"NetworkTypeMenu_WiFi"   = "WiFi";
"NetworkTypeMenu_All"    = "All";

// Main screen - network type selector button text
"ShowingResults_Mobile"  = "Showing Mobile results";
"ShowingResults_WiFi"    = "Showing WiFi results";
"ShowingResults_All"     = "Showing all results";

// e.g. Unknown network type string... displayed if network type cannot be deterined.
"Unknown" = "Unknown";

// Yes/No strings for alerts and menus...
"MenuAlert_Yes"     = "Yes";
"MenuAlert_No"      = "No";
"MenuAlert_Cancel"  = "Cancel";
"MenuAlert_OK"  = "OK";
"Export_Title"  = "Export archived results?";
"Export_Body"  = "Do you want to use email to export a zip file of archived results in JSON format?";
"Export_NoItems_Title" = "Unable to export";
"Export_NoItems_Body" = "No archived test results were found for the export. Please run a test and then try to export again.";
"Export_Failed_Title" = "Unable to export";
"Export_Failed_Body" = "Sorry, the export failed.";

// Menu items
"Menu_Settings" = "Settings";
"Menu_About" = "About";
"Menu_TermsOfUse" = "Terms of Use";
"Menu_Export" = "Export Results";
"MenuExport_Mail_Subject" = "Archived test results";
"MenuExport_Mail_Body" = "FCC Speed test - archived test results";

"SocialMediaOption_Twitter" = "Twitter";
"SocialMediaOption_Facebook" = "Facebook";
"SocialMediaOption_SinaWeibo" = "Sina Weibo";

// Various alert titles:
"Title_ShareUsingSocialMediaInfo" = "Share using Social Media";
"Message_ShareUsingSocialMediaInfo" = "In order to share your Mobile test results, you must first configure a Social Media account (such as Twitter or Facebook) on your iOS device.";
"Title_ShareUsingSocialMediaMobile" = "Share using Social Media";
"Message_ShareUsingSocialMediaMobile" = "Only Mobile test results can be shared using Social Media.";
"Title_ShareUsingSocialMedia" = "Share using Social Media:";
"Title_SelectResultsToShow" = "Select results to show:";
"Title_SelectOption" = "Select option:";
"Title_MonthlyDataCap" = "Monthly data cap?";

// About screen
"About_Version" = "Version";

// Connection type localized description strings
"ConnectionString_Offline"  = "Offline";
"ConnectionString_Cellular" = "Cellular";
"ConnectionString_WiFi"     = "WiFi";

// Test Results screen section headers
"ResultsTestHeader_ActiveMetrics_Mobile" = "Active Metrics (Mobile)";
"ResultsTestHeader_ActiveMetrics_WiFi"   = "Active Metrics (WiFi)";
"ResultsTestHeader_PassiveMetrics"       = "Passive Metrics";

// Graph suffixes
"Graph_Suffix_Mbps"       = "Mbps";
"Graph_Suffix_Ms"         = "ms";
"Graph_Suffix_Percent"    = "%";

// Graph titles
"Graph_Title_Mbps"       = "Mbps";
"Graph_Title_Ms"         = "ms  ";
"Graph_Title_Percent"    = "%   ";
"Graph_Title_Sec"        = "sec ";

// Settings screen - placeholder text
"Settings_DataCap_Placeholder" = "Data cap";

// Various storyboard items
"Storyboard_SKAMainResultsController_Title" = "Results";
"Storyboard_GraphViewFooterCell_CenterLabel" = "Load more data";
"Storyboard_GraphViewCell_DataTimeLabel" = "Date / Time";
"Storyboard_GraphViewCell_LocationLabel" = "Location";
"Storyboard_GraphViewCell_ResultLabel" = "Result";

// The paged terms screen - only show on first use after installation
"Storyboard_Terms_Title" = "Terms";
"Storyboard_Terms_DataLabel" = "Please choose the amount of data (in MB) the Application should use each month :";

// Activation screen - only show on first use after installation
"Storyboard_Activation_Title" = "Activation";

// Terms screen - as shown from app menu
"Storyboard_SummaryTerms_Title" = "Privacy & Terms of Use";

// About screen
"Storyboard_About_Title" = "About";
"Storyboard_About_Section_AppName"    = "FCC Speed Test";
"Storyboard_About_Section_Download"   = "Download";
"Storyboard_About_Section_Upload"     = "Upload";
"Storyboard_About_Section_Latency"    = "Latency";
"Storyboard_About_Section_PacketLoss" = "Packet Loss";
"Storyboard_About_Section_Jitter"     = "Jitter";
"Storyboard_About_Text_Download"   = "This should be indicative of the maximum speed your broadband connection will be able to download data from the Internet.  Results are recorded in Mbps (higher is better).";
"Storyboard_About_Text_Upload"     = "This should be indicative of the maximum speed your broadband connection will be able to transmit data to the Internet.  Results are recorded in Mbps (higher is better).";
"Storyboard_About_Text_Latency"    = "This test measures how long it takes one packet to be sent to one of our test servers, and then returned back to you.  Latency can be thought of as the responsiveness of the connection from your device and our servers on the Internet. Times are recorded here in milliseconds (lower is better).";
"Storyboard_About_Text_PacketLoss" = "Packet loss occurs when the information sent by your device fails to reach its destination. When packet loss is high, you may find that time sensitive applications such as Voice over IP (VoIP) and online gaming will suffer. Packet loss is recorded here as a percentage (lower is better).";
"Storyboard_About_Text_Jitter"     = "This test measures how long it takes one packet to be sent to one of our test servers, and then returned back to you.  Latency can be thought of as the responsiveness of the connection from your device and our servers on the Internet. Times are recorded here in milliseconds (lower is better).";


// Archived Results screen
"Storyboard_ArchivedResults_Title" = "Archived Results";
"Storyboard_ArchivedResults_Archived_Result" = "Archived Result";
// e.g. 1 of 33 ... this is the "of" bit...
"Storyboard_ArchivedResults_Of_Separator" = "of";

// Settings screen
"SETTINGS_Title"         = "Settings";
"SETTINGS_Data_Cap"      = "Monthly data cap";
"SETTINGS_Data_Usage"    = "Monthly data used";
"SETTINGS_Config"        = "Configuration version";
"SETTINGS_App"           = "Application version :";
"Storyboard_Settings_Configuration" = "Configuration";
"Storyboard_Settings_MonthlyData" = "Monthly Data";
"Settings_ClearAllResults" = "Clear all results";
"Settings_ClearAllResults_Title" = "Clear all results?";
"Settings_ClearAllResults_Message" = "Do you want to clear all your result data?";
"Settings_Activate" = "Activate";

// Radio technology types...
"CTRadioAccessTechnologyUnknown" = "Unknown";
"CTRadioAccessTechnologyGPRS" = "GPRS";
"CTRadioAccessTechnologyEdge" = "Edge";
"CTRadioAccessTechnologyWCDMA" = "WCDMA";
"CTRadioAccessTechnologyHSDPA" = "HSDPA";
"CTRadioAccessTechnologyHSUPA" = "HSUPA";
"CTRadioAccessTechnologyCDMA1x" = "CDMA 1xRTT";
"CTRadioAccessTechnologyCDMAEVDORev0" = "CDMA 1xEV-DO";
"CTRadioAccessTechnologyCDMAEVDORevA" = "CDMA EVDO Rev. A";
"CTRadioAccessTechnologyCDMAEVDORevB" = "CDMA EVDO Rev. B";
"CTRadioAccessTechnologyeHRPD" = "eHRPD";
"CTRadioAccessTechnologyLTE" = "LTE";

"UDP blocked" = "UDP blocked";
"Include screenshot?" = "Include screenshot?";
"Would you like to include a screenshot with your social media post?" = "Would you like to include a screenshot with your social media post?";
